{
    "LDAP0x00": "Requisição com o LDAP foi bem sucedida.",
    "LDAP0x01": "Inicialização da biblioteca do LDAP falhou.",
    "LDAP0x02": "Ocorreu um erro de protocolo no LDAP.",
    "LDAP0x03": "Prazo excedeu no LDAP.",
    "LDAP0x04": "Tamanho limite foi excedido no LDAP.",
    "LDAP0x05": "Comparação no LDAP não existe.",
    "LDAP0x06": "Comparação no LDAP existente.",
    "LDAP0x07": "O método de autenticação no LDAP não é suportado.",
    "LDAP0x08": "A autenticação forte no LDAP é necessária.",
    "LDAP0x09": "Resultados parciais e encaminhamentos recebidos no LDAP.",
    "LDAP0x0a": "Ocorreu um encaminhamento no LDAP.",
    "LDAP0x0b": "Limite do administrador no servidor do LDAP excedeu.",
    "LDAP0x0c": "Extensão crítica não está disponível no LDAP.",
    "LDAP0x0d": "O sigilo é necessário no LDAP.",
    "LDAP0x10": "Atributo solicitado não existe no LDAP.",
    "LDAP0x11": "O tipo não está definido no LDAP.",
    "LDAP0x12": "Ocorreu uma correspondência inadequada no LDAP.",
    "LDAP0x13": "Uma violação de restrição ocorreu no LDAP.",
    "LDAP0x14": "O atributo existe ou o valor foi atribuído no LDAP.",
    "LDAP0x15": "A sintaxe é inválida no LDAP.",
    "LDAP0x20": "Objeto não existe no LDAP.",
    "LDAP0x21": "A sigla (apelido) é inválida no LDAP.",
    "LDAP0x22": "O nome distinto tem uma sintaxe inválida no LDAP.",
    "LDAP0x23": "O objeto é um objeto que pode conter outros objetos no LDAP.",
    "LDAP0x24": "Não pode indentificar o apelido no LDAP.",
    "LDAP0x30": "A autenticação no LDAP é inadequada.",
    "LDAP0x31": "Usuário/senha do LDAP inválidos.",
    "LDAP0x32": "Os direitos de acesso do usuário são insuficientes no LDAP.",
    "LDAP0x33": "O servidor do LDAP está ocupado.",
    "LDAP0x34": "O servidor do LDAP não está disponível.",
    "LDAP0x35": "O servidor do LDAP não manipula requisições do diretório.",
    "LDAP0x36": "A cadeia de encaminhamento tem loop de volta para um servidor de referência no LDAP.",
    "LDAP0x40": "Houve uma violação de nome no LDAP.",
    "LDAP0x41": "Ocorreu uma violação na classe do objeto no LDAP.",
    "LDAP0x42": "Operação não é permitida em um objeto que pode conter outros objetos no LDAP.",
    "LDAP0x43": "A operação não é permitida em um atributo RDN do LDAP.",
    "LDAP0x44": "O objeto já existe no LDAP.",
    "LDAP0x45": "Não pode modificar a classe de objeto no LDAP.",
    "LDAP0x46": "Os resultados retornados são muito grandes no LDAP.",
    "LDAP0x47": "Vários agentes do serviço de diretório do LDAP são afetados.",
    "LDAP0x50": "Ocorreu um erro desconhecido no LDAP.",
    "LDAP0x51": "Não foi possível conectar no servidor LDAP.",
    "LDAP0x52": "Ocorreu um erro local no LDAP.",
    "LDAP0x53": "Ocorreu um erro de codificação no LDAP.",
    "LDAP0x54": "Ocorreu um erro de decodificação no LDAP.",
    "LDAP0x55": "O tempo de consulta no LDAP expodiu.",
    "LDAP0x56": "Ocorreu um erro de autenticação no LDAP desconhecido.",
    "LDAP0x57": "O filtro de pesquisa no LDAP está incorreto.",
    "LDAP0x58": "O usuário cancelou a operação com o LDAP.",
    "LDAP0x59": "Um parâmetro incorreto foi passado para a rotina no LDAP.",
    "LDAP0x5a": "O sistema no LDAP está sem memória.",
    "LDAP0x5b": "Não é possível estabelecer uma conexão com o servidor do LDAP.",
    "LDAP0x5c": "O recurso não é suportado no LDAP.",
    "LDAP0x5d": "AO controle especificado não foi encontrado no LDAP.",
    "LDAP0x5e": "Não foi devolvido nenhum resultado LDAP.",
    "LDAP0x5f": "Resultados adicionais devem ser devolvidos do LDAP.",
    "LDAP0x60": "Loop no cliente foi detectado.",
    "LDAP0x61": "O limite de encaminhamento foi excedido.",
    "LDAP0x0E": "Ligamento intermediário para multiplos estágios de ligação"
}
